# FlowConversionMethod Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipingSystemType..::..FlowConversionMethod Property
PipingSystemType Class See Also
---
The flow conversion method for the piping system type.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public FlowConversionMode FlowConversionMethod { get; set; }
```

Visual Basic
---
```text
Public Property FlowConversionMethod As FlowConversionMode
	Get
	Set
```

Visual C++
---
```text
public:
property FlowConversionMode FlowConversionMethod {
	FlowConversionMode get ();
	void set (FlowConversionMode value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
PipingSystemType Class
Autodesk.Revit.DB.Plumbing Namespace